# a = int(input())
# b = int(input())
# n = int(input())
# print(n * a + b * n // 100)
# print(n * b % 100)

# Логический тип данных
# a = 10
# l = "Hello"

# n = 10 + 5
# print(n)

# r = 10 > 5
# print(11 > 4)
# print(r)
# print(10 == 10)

# >
# <
# >=
# <=
# ==
# !=

# x = int(input('Введите координату выстрела: '))
# print(x > 7)

# x = int(input('Введите координату выстрела: '))
# print(3 < x and x < 8)
# print(3 < x < 8)


# x = int(input('Введите координату выстрела: '))
# print(3 > x or x > 8)
# x = 10
# print(not (x == 10))
# print(x != 10)

# Сокращенные операторы

# rubles = 100
# print(rubles + 10)
# rubles = rubles + 10
# rubles += 10

# Пользователь вводит кол-во конфет в тарелке
# a = 100
# a += 10
# a -= 10
# a *= 10
# a //= 10
# a /= 10
# a %= 10


age = int(input('Введите возраст: '))
# print(age >= 18)

if age >= 18:
    print('Проходите')
else:
    print('Уходите')

print('Вот и все')

Кол-во рублей. Если рублей больше 50, печатаем "Можешь купить пирожок"







